{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "Input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 150, 2], "dtype": "float32", "sparse": false, "name": "Input_1"}, "inbound_nodes": []}, {"name": "Convolution2D_1", "class_name": "Conv2D", "config": {"name": "Convolution2D_1", "trainable": true, "filters": 16, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Input_1", 0, 0, {}]]]}, {"name": "BatchNormalization_1", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution2D_1", 0, 0, {}]]]}, {"name": "MaxPooling2D_1", "class_name": "MaxPooling2D", "config": {"name": "MaxPooling2D_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["BatchNormalization_1", 0, 0, {}]]]}, {"name": "Convolution2D_3", "class_name": "Conv2D", "config": {"name": "Convolution2D_3", "trainable": true, "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPooling2D_1", 0, 0, {}]]]}, {"name": "BatchNormalization_2", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution2D_3", 0, 0, {}]]]}, {"name": "MaxPooling2D_2", "class_name": "MaxPooling2D", "config": {"name": "MaxPooling2D_2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["BatchNormalization_2", 0, 0, {}]]]}, {"name": "Convolution2D_4", "class_name": "Conv2D", "config": {"name": "Convolution2D_4", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPooling2D_2", 0, 0, {}]]]}, {"name": "BatchNormalization_3", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution2D_4", 0, 0, {}]]]}, {"name": "MaxPooling2D_3", "class_name": "MaxPooling2D", "config": {"name": "MaxPooling2D_3", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["BatchNormalization_3", 0, 0, {}]]]}, {"name": "Convolution2D_5", "class_name": "Conv2D", "config": {"name": "Convolution2D_5", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["MaxPooling2D_3", 0, 0, {}]]]}, {"name": "BatchNormalization_4", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_4", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution2D_5", 0, 0, {}]]]}, {"name": "Convolution2D_6", "class_name": "Conv2D", "config": {"name": "Convolution2D_6", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["BatchNormalization_4", 0, 0, {}]]]}, {"name": "BatchNormalization_5", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_5", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution2D_6", 0, 0, {}]]]}, {"name": "UpSampling2D_1", "class_name": "UpSampling2D", "config": {"name": "UpSampling2D_1", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["BatchNormalization_5", 0, 0, {}]]]}, {"name": "Convolution2D_7", "class_name": "Conv2D", "config": {"name": "Convolution2D_7", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["UpSampling2D_1", 0, 0, {}]]]}, {"name": "BatchNormalization_6", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_6", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution2D_7", 0, 0, {}]]]}, {"name": "UpSampling2D_2", "class_name": "UpSampling2D", "config": {"name": "UpSampling2D_2", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["BatchNormalization_6", 0, 0, {}]]]}, {"name": "Convolution2D_8", "class_name": "Conv2D", "config": {"name": "Convolution2D_8", "trainable": true, "filters": 8, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["UpSampling2D_2", 0, 0, {}]]]}, {"name": "BatchNormalization_7", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_7", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution2D_8", 0, 0, {}]]]}, {"name": "UpSampling2D_3", "class_name": "UpSampling2D", "config": {"name": "UpSampling2D_3", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["BatchNormalization_7", 0, 0, {}]]]}, {"name": "ZeroPadding2D_1", "class_name": "ZeroPadding2D", "config": {"name": "ZeroPadding2D_1", "trainable": true, "padding": [[2, 2], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["UpSampling2D_3", 0, 0, {}]]]}, {"name": "Convolution2D_9", "class_name": "Conv2D", "config": {"name": "Convolution2D_9", "trainable": true, "filters": 1, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["ZeroPadding2D_1", 0, 0, {}]]]}, {"name": "BatchNormalization_8", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_8", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution2D_9", 0, 0, {}]]]}], "input_layers": [["Input_1", 0, 0]], "output_layers": [["BatchNormalization_8", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}